[
    {
        "title":"Рекомендательная система",
        "description":"Рекомендательные системы или рекомендательные системы (иногда заменяющие 'систему' синонимом, таким как платформа или движок) представляют собой подкласс систем фильтрации информации, которые стремятся предсказать \"рейтинг\" или \"предпочтение\", которое пользователь отдаст элементу (например, музыке, книгам или фильмам) или социальному элементу(например, люди или группы), которые они еще не рассматривали, используя модель, построенную на основе характеристик элемента (подходы, основанные на контенте) или социальной среды пользователя (подходы совместной фильтрации)",
        "url":"https://link.springer.com/article/10.1007/s13042-017-0762-9"
    },
    {
        "title":"User-based",
        "description":"Коллаборативные системы, основанные на пользователях (user-based), находят близких по предпочтениям пользователей и рекомендуют одному из них то, что уже попробовал другой.",
        "url":"http://www0.cs.ucl.ac.uk/staff/jun.wang/papers/2006-sigir06-unifycf.pdf"
    },
    {
        "title":"Item-based",
        "description":"Системы, основанные на предмете рекомендации (item-based), сравнивают непосредственно близость товаров или услуг. Причем что отличает эту систему, сходство определяется на основе предпочтений всех пользователей, которые оставили свои оценки.",
        "url":"http://www0.cs.ucl.ac.uk/staff/jun.wang/papers/2006-sigir06-unifycf.pdf"
    },
    {
        "title":"Web-приложение",
        "description":"Клиент-серверное приложение, в котором клиент взаимодействует с веб-сервером при помощи браузера. Логика веб-приложения распределена между сервером и клиентом, хранение данных осуществляется, преимущественно, на сервере, обмен информацией происходит по сети.",
        "url":"https://lib.samtuit.uz/uploads/files/61e53302a60010.80757431.pdf"
    },
    {
        "title":"Архитектура",
        "description":"Совокупность программных и аппаратных средств, составляющая информационную систему организации и включающая, в частности, базы данных и промежуточное программное обеспечение.",
        "url":"https://books.google.com/books?hl=ru&lr=&id=1CUkEAAAQBAJ&oi=fnd&pg=PA4&dq=архитектура+программы+это&ots=7--oPVkm1Z&sig=JiowSR8041GN3ChxYSGO3TsVJdg"
    },
    {
        "title":"Микросервисная",
        "description":"Cпособ создания программных продуктов, предполагающий разработку независимых друг от друга модулей. Каждая часть приложения отвечает за определенную задачу и может быть изменена или расширена без дополнений в других. При этом сервисы взаимодействуют между собой с помощью обмена сообщениями. Проще говоря, микросервисная архитектура – это деление на модули в соответствии с запросами бизнеса.",
        "url":"https://cyberleninka.ru/article/n/patterny-mikroservisnoy-arhitektury-mnogoprofilnyy-obzor-literatury"
    },
    {
        "title":"Docker",
        "description":"это проект с открытым исходным кодом для автоматизации развертывания приложений в виде переносимых автономных контейнеров, выполняемых в облаке или локальной среде.",
        "url":"https://docs.docker.com/get-started/overview/"
    },
    {
        "title":"Язык программирования",
        "description":"Формальный язык, содержащий набор инструкций, которые производят различные виды выходных данных. Языки программирования используются в компьютерном программировании для реализации алгоритмов.",
        "url":"https://books.google.com/books?hl=ru&lr=&id=J_8-EAAAQBAJ&oi=fnd&pg=PA15&dq=Теория+и+практика+языков+программирования.+Учебник+для+...books.google.ru+›+books+Орлов+Сергей+Александрович+·+2021&ots=FZf4vRuar5&sig=Bl25iQR7fX9F3ivI83ZvXwhSfzw"
    },
    {
        "title":"Front-end",
        "description":"практика преобразования данных в графический интерфейс с использованием HTML, CSS и JavaScript, чтобы пользователи могли просматривать эти данные и взаимодействовать с ними.",
        "url":"https://www.tandfonline.com/doi/pdf/10.1080/21573727.2013.775942"
    },
    {
        "title":"Back-end",
        "description":"Программно-аппаратная часть сервиса. Это набор средств, с помощью которых происходит реализация логики веб-сайта. Это то, что скрыто от наших глаз, т. е. происходит вне компьютера и браузера.",
        "url":"https://books.google.com/books?hl=ru&lr=&id=MHLJlUfXV4QC&oi=fnd&pg=PR23&dq=Back-end+&ots=82Gri_LZFB&sig=Bk-WIiAmURSkKgS726_LHT6TKh8"
    },
    {
        "title":"Фреймворк",
        "description":"Фреймворк — это программная платформа, которая упрощает разработку программного продукта, определяет структуру проекта и помогает удобно объединять в нём разные компоненты. От выбора фреймворка на проекте зависит многое: зарплаты и возможности найма разработчиков, процессы, технологии и скорость разработки.",
        "url":"https://natural.chronos-journal.ru/archive/2-30/5.pdf"
    },
    {
        "title":"NumPy",
        "description":"Библиотека с открытым исходным кодом для языка программирования Python.",
        "url":"https://numpy.org/?o=/"
    },
    {
        "title":"Python",
        "description":"Язык программирования, который широко используется в интернет-приложениях, разработке программного обеспечения, науке о данных и машинном обучении (ML). Разработчики используют Python, потому что он эффективен, прост в изучении и работает на разных платформах.",
        "url":"https://aws.amazon.com/ru/what-is/python/"
    },
    {
        "title":"JavaScript",
        "description":"Мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией спецификации ECMAScript.",
        "url":"https://dl.acm.org/doi/abs/10.1145/3386327"
    }
    ,
    {
        "title":"C++",
        "description":"Язык программирования общего назначения, созданный Бьярне Страуструпом как расширение языка программирования C, или \"C с классами\". Со временем язык значительно расширился, и современный C++ теперь обладает объектно-ориентированными, универсальными и функциональными функциями в дополнение к средствам низкоуровневого манипулирования памятью.",
        "url":"https://link.springer.com/article/10.1186/s13321-020-0415-y"
    },
    {
        "title":"WebAssembly",
        "description":"Низкоуровневый язык, похожий на ассемблер, с компактным двоичным форматом, который работает с почти естественной производительностью и предоставляет низкоуровневые модели памяти для таких языков как C++ и Rust, с целью компиляции, чтобы они могли работать в интернете.",
        "url":"https://www.google.ru/books/edition/WebAssembly_в_действии/A9REEAAAQBAJ?hl=ru&gbpv=0"
    },
    {
        "title":"Flask",
        "description":"Фреймворк для создания веб-приложений на языке программирования Python, использующий набор инструментов Werkzeug, а также шаблонизатор Jinja2. Относится к категории так называемых микрофреймворков - минималистичных каркасов веб-приложений, сознательно предоставляющих лишь самые базовые возможности",
        "url":"https://flask.palletsprojects.com/en/latest/"
    },
    {
        "title":"NestJS",
        "description":"Это фреймворк, который ускоряет и упрощает разработку масштабируемых серверных приложений на основе программной платформы Node.js. Он использует прогрессивный JavaScript, полностью поддерживает TypeScript и совмещает в себе три парадигмы (концепции) программирования:\nобъектно-ориентированную\nфункциональную\nфункционально-реактивную",
        "url":""
    }

]